# InnerFillet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralH..::..InnerFillet Property
StructuralSectionGeneralH Class See Also
---
Inner Fillet - Corner fillet inner radius.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double InnerFillet { get; set; }
```

Visual Basic
---
```text
Public Property InnerFillet As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double InnerFillet {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionGeneralH Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace